$(document).ready(function () {
    const requestdetail = [
        {"order" : "1" , "detail" : "ทุนการศึกษา และค่าอาหารกลางวันเลี้ยงเด็กพิการซ้ำซ้อนทางสายตา(โรงเรียนเด็กตาบอดพิการซ้ำซ้อน) บริจาค จำนวนประมาณ 30 คน ระยะเวลา 12 เดือนเฉลี่ยเดือนละ 278 บาท ต่อคนต่อเดือน" , "number" : "เหมา" , "price" : "100,000"},
        {"order" : "2" , "detail" : "ทุนการศึกษา และค่าอาหารกลางวันเลี้ยงเด็กพิการทางสายตา(โรงเรียนสอนเด็กตาบอด เพชรบุรี) บริจาคจำนวน 60 คนระยะเวลา 12 เดือน เฉลี่ยเดือนละ 139 บาท ต่อคนต่อเดือน" , "number" : "เหมา" , "price" : "100,000"},
        {"order" : "3" , "detail" : "ค่าอุปกรณ์ป้องกัน COVID 200 บาทจำนวน 74 คน(ประกอบด้วยค่าบริการการตรวจโควิด-19 ด้วยวิธี ATK ผู้เดินทางทุกคนก่อนการเดืนทาง 48 ชม. จำนวน 74 คน + แอลกอฮอล์พ่นตัวเสื้อผ้าก่อนขึ้นรถ (Food Grade) 1 แกลลอนใหญ่ + เจลแอลกอฮอล์ล้างมือจำนวน 70 ชวด ขวดละ 20 บาท + แมสทางการแพทย์คนบะ 2 ชิ้นจำนวน 140 ชิ้น)" , "number" : "70 คน" , "price" : "14,000"},
        {"order" : "4" , "detail" : "ค่าใช้จ่ายในการติดต่อประสานงาน" , "number" : "เหมา" , "price" : "3,000"},
    ]

    var table = $("#detailrequesttable").DataTable({
        "dom": '<"pull-right"f><"pull-left"l>tip',
        responsive: true,
        data: requestdetail,
        columns: [
            { data: "order", title: "ลำดับ" },
            { data: "detail", title: "รายการ" },
            { data: "number", title: "จำนวน" },
            { data: "price", title: "จำนวนเงิน" }
        ]
    });

    $("#btnnonapprove").on("click" , function() {
        $("#modalreason").modal("show")
    });
});